{"product_url": "https://www.veeranutri.com/product/yonex-nano-speed-badminton-racket/", "product_name": "Yonex Nano Speed Badminton Racket", "description": "Introducing the Yonex Nano Speed Badminton Racket, the ultimate choice for badminton enthusiasts in Sri Lanka. Engineered with cutting-edge technology and precision craftsmanship, this racket is designed to elevate your game to new heights. With its advanced features and exceptional performance, the Racket is the go-to choice for players seeking unparalleled speed, power, and control on the court. Its lightweight yet sturdy construction allows for lightning-fast swings and swift maneuverability, giving you the competitive edge you need to dominate your opponents. Our Sri Lanka customers can now experience the best price for the Yonex Nano Speed Badminton Racket. Designed with affordability in mind, this racket offers incredible value without compromising on quality. We understand that finding a top-quality racket at an affordable price is essential, and that’s why we bring you this exclusive offer. Shop online with confidence and convenience as we provide a seamless shopping experience tailored to Sri Lanka badminton enthusiasts. Our online store features a wide range of Yonex rackets, including the Nano Speed series, ensuring that you find the perfect match for your playing style and preferences. Don't miss out on this limited stock opportunity. Buy the Yonex Nano Speed Badminton Racket today and unleash your true potential on the court. Elevate your game, dominate the competition, and experience badminton like never before. Shop now and enjoy the thrill of playing with the best racket in Sri Lanka. Featuers Level - Intermidiate/Advance Type - All Surround Weight - 87-89 Gm Most Suitable for Home Play", "price": "3499.00", "currency": "Rs.", "product_rating": null, "availability": true, "shipping": true, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://www.veeranutri.com/wp-content/uploads/2023/06/Untitled-design-7.png", "latest_reviews": []}